{

    "engines" :

        {
            "gpt-3.5-turbo": ["(cheap and good enough)", 0.002, 0.002],

            "gpt-4": ["(expensive but great)", 0.03, 0.06]
        }

        ,

    "templates":

        {

            "👤 A helpful assistant (no template selected)": ["You're a helpful assistant. Your answers will be as accurate as possible while also being specific. You are permitted to take guesses, but you must indicate if your answer is speculative. Think methodically, step by step."],

            "✎ Grammarly at home: editing mode": ["You are an experienced and well-read English teacher and proofreader.","The following is a text in English written by a non-native speaker. Edit it so that it is free of spelling mistakes and ugly or unnatural phrases, so that it is indistinguishable from the text of a native speaker. Insert a three-star separator after your answer, followed by an explanation of one or two corrections that will help the author avoid repeating these errors."],

            "✎ Grammarly at home: mentoring mode": ["You are an experienced and well-read English teacher and proofreader.","The following is a text in English written by a non-native speaker. DO NOT EDIT THE TEXT. Instead, give me a list of all grammar errors and otherwise problematic passages with a short explanation so I can avoid making the same mistakes in the future."],

            "💻 A programming coach": ["You're a senior programmer working as a helpful yet brutally honest programming coach. You're going to fix my code and answer my questions, while you're also going to make me a better programmer. This means you'll explain related context and concepts to me, so I won't repeat the same mistakes again.", "Here's my problem or question:","Now help me and educate me."],

            "💩 Emojis for a thing or a concept": ["You're a skilled and creative social media marketer with great experience.","What follows is a thing, a concept or an idea.","Please give me various emojis related to the thing, concept or idea. Each of the emojis should be usable on its own. I am not interested in combinations of two or more emojis. Write a short explanation to each recommended emoji."],

            "➽ Sum up the article": ["You're a professional researcher.","What follows is a news article. Sum up the article in one paragraph."]

        },

    "interface":
        
        {

            "title" : "Gusta, a GPT processor", 

            "message_up" : "Enter the variable part of your prompt here. Then press CTRL+ENTER or click the response 🧠 button.",

            "message_down" : "Hi! I'm Gusta, a GPT prompt processor. Your buddy for asking GPT over and over.\n\nI found and loaded the CONFIG.USER.JSON configuration file, so everything should be up and running.\n\nIf anything goes wrong, the most likely reason is a missing or incorrect GPT API key. In that case, you can get your API key here: https://platform.openai.com/account/api-keys.\n\nFeel free to explore the CONFIG.USER.JSON further. You can easily add your own prompt templates by modifying the examples. Each template has three parts: the system prompt, and two parts of the actual prompt. The variable part from the field above will be placed in between these two. It's okay to leave the second part of the actual prompt empty. You can use the sample prompts as inspiration.\n\nFor more information and updates, visit https://github.com/michalkasparek/gusta",

            "url" : "http://",

            "scrape" : "Load an article 🕸",

            "answer" : "Get a response 🧠",

            "copy" : "Copy to clipboard 📋",

            "top" : "On top",

            "archive" : "Archive",

            "message_up_no_key": "Hi! I'm Gusta, a GPT prompt processor. Your buddy for asking GPT over and over.",

            "message_down_no_key" : "Begin by renaming the CONFIG.USER_SAMPLE.JSON configuration file to CONFIG.USER.JSON. You need to paste your GPT API key into the 'key' field in the JSON file. You can obtain the API key at at https://platform.openai.com/account/api-keys.\n\nFor more information and updates, visit https://github.com/michalkasparek/gusta",

            "answer_no_key" : "No API key 😔",

            "bad_url" : "Something went wrong. Maybe there was no URL entered in the prompt box. Perhaps there is no recognizable text in the article on the webpage. Lastly, maybe you are offline.\n\nHere is the error message: "

        }

}